# Pandas Notebook

In [ ]:
!pip install pandas

In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.precision", 2)
pd.set_option("display.width", 100)

## 1) Mental model: dict of Series + axis

In [2]:
df = pd.DataFrame({
    "Name": ["Ana", "Ben", "Cara", "Dan", "Eva", "Finn", "Gina", "Hugo", "Ivy", "Jack"],
    "Age": [28, 35, 22, 40, 31, 27, 24, 38, 29, 33],
    "City": ["NY", "Paris", "NY", "London", "Paris", "Berlin", "NY", "London", "Berlin", "Paris"],
    "Salary": [52000, 68000, 45000, 82000, 61000, 54000, 48000, 79000, 56000, 65000],
    "Experience_Years": [4, 10, 1, 15, 7, 3, 2, 12, 5, 9],
    "Performance_Score": [3.8, 4.2, 3.5, 4.6, 4.1, 3.9, 3.6, 4.4, 4.0, 4.3],
})
df

   Name  Age    City  Salary  Experience_Years  Performance_Score
0   Ana   28      NY   52000                 4                3.8
1   Ben   35   Paris   68000                10                4.2
2  Cara   22      NY   45000                 1                3.5
3   Dan   40  London   82000                15                4.6
4   Eva   31   Paris   61000                 7                4.1
5  Finn   27  Berlin   54000                 3                3.9
6  Gina   24      NY   48000                 2                3.6
7  Hugo   38  London   79000                12                4.4
8   Ivy   29  Berlin   56000                 5                4.0
9  Jack   33   Paris   65000                 9                4.3

In [3]:
df.columns.tolist()

['Name', 'Age', 'City', 'Salary', 'Experience_Years', 'Performance_Score']

In [4]:
df["Name"]

0     Ana
1     Ben
2    Cara
3     Dan
4     Eva
5    Finn
6    Gina
7    Hugo
8     Ivy
9    Jack
Name: Name, dtype: object

In [5]:
type(df), type(df["Name"])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [7]:
df["Age"].mean(axis=0)  # axis=0 => down rows (per column)

np.float64(30.7)

## 2) Selection (loc), filtering, assignment

In [8]:
df.loc[0, "Name"]

'Ana'

In [9]:
df.loc[0:1, ["Name", "Age"]]

  Name  Age
0  Ana   28
1  Ben   35

In [10]:
df[df["Age"] > 25]

   Name  Age    City  Salary  Experience_Years  Performance_Score
0   Ana   28      NY   52000                 4                3.8
1   Ben   35   Paris   68000                10                4.2
3   Dan   40  London   82000                15                4.6
4   Eva   31   Paris   61000                 7                4.1
5  Finn   27  Berlin   54000                 3                3.9
7  Hugo   38  London   79000                12                4.4
8   Ivy   29  Berlin   56000                 5                4.0
9  Jack   33   Paris   65000                 9                4.3

In [11]:
df[(df["City"] == "NY") & (df["Age"] < 30)]

   Name  Age City  Salary  Experience_Years  Performance_Score
0   Ana   28   NY   52000                 4                3.8
2  Cara   22   NY   45000                 1                3.5
6  Gina   24   NY   48000                 2                3.6

In [12]:
df["Is_Adult"] = df["Age"] >= 18
df

   Name  Age    City  Salary  Experience_Years  Performance_Score  Is_Adult
0   Ana   28      NY   52000                 4                3.8      True
1   Ben   35   Paris   68000                10                4.2      True
2  Cara   22      NY   45000                 1                3.5      True
3   Dan   40  London   82000                15                4.6      True
4   Eva   31   Paris   61000                 7                4.1      True
5  Finn   27  Berlin   54000                 3                3.9      True
6  Gina   24      NY   48000                 2                3.6      True
7  Hugo   38  London   79000                12                4.4      True
8   Ivy   29  Berlin   56000                 5                4.0      True
9  Jack   33   Paris   65000                 9                4.3      True

## 3) Inspection

In [13]:
df.head()

   Name  Age    City  Salary  Experience_Years  Performance_Score  Is_Adult
0   Ana   28      NY   52000                 4                3.8      True
1   Ben   35   Paris   68000                10                4.2      True
2  Cara   22      NY   45000                 1                3.5      True
3   Dan   40  London   82000                15                4.6      True
4   Eva   31   Paris   61000                 7                4.1      True

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               10 non-null     object
 1   Age                10 non-null     int64
 2   City               10 non-null     object
 3   Salary             10 non-null     int64
 4   Experience_Years   10 non-null     int64
 5   Performance_Score  10 non-null     float64
 6   Is_Adult           10 non-null     bool
dtypes: bool(1), float64(1), int64(3), object(2)
memory usage: 622.0+ bytes

In [15]:
df.describe(include="all")

       Name    Age City    Salary  Experience_Years  Performance_Score Is_Adult
count    10  10.00   10     10.00             10.00              10.00       10
unique   10    NaN    4       NaN               NaN                NaN        1
top     Ana    NaN   NY       NaN               NaN                NaN     True
freq      1    NaN    3       NaN               NaN                NaN       10
mean    NaN  30.70  NaN  61000.00              6.80               4.04      NaN
std     NaN   5.85  NaN  12516.66              4.61               0.35      NaN
min     NaN  22.00  NaN  45000.00              1.00               3.50      NaN
25%     NaN  27.25  NaN  52500.00              3.25               3.82      NaN
50%     NaN  30.00  NaN  58500.00              6.00               4.05      NaN
75%     NaN  34.50  NaN  67250.00              9.75               4.28      NaN
max     NaN  40.00  NaN  82000.00             15.00               4.60      NaN

In [16]:
df.shape, df.columns.tolist()

((10, 7),
 ['Name',
  'Age',
  'City',
  'Salary',
  'Experience_Years',
  'Performance_Score',
  'Is_Adult'])

## 4) Cleaning

In [17]:
dirty = pd.DataFrame({"A": [1.0, np.nan, 1.0], "B": ["x", "x", "x"]})
dirty

     A  B
0  1.0  x
1  NaN  x
2  1.0  x

In [18]:
dirty.dropna()

     A  B
0  1.0  x
2  1.0  x

In [19]:
dirty

     A  B
0  1.0  x
1  NaN  x
2  1.0  x

In [20]:
dirty.fillna(0)

     A  B
0  1.0  x
1  0.0  x
2  1.0  x

In [21]:
dupes = pd.concat([dirty, dirty.iloc[[0]]], ignore_index=True)
dupes

     A  B
0  1.0  x
1  NaN  x
2  1.0  x
3  1.0  x

In [22]:
dupes.drop_duplicates()

     A  B
0  1.0  x
1  NaN  x

## 5) GroupBy (split-apply-combine)

In [23]:
df.groupby("City")["Age"].mean()

City
Berlin    28.00
London    39.00
NY        24.67
Paris     33.00
Name: Age, dtype: float64

## 6) Concatenation and merge

In [24]:
df_top = pd.DataFrame({"A": [1, 2], "B": [5, 6]})
df_bottom = pd.DataFrame({"A": [3, 4], "B": [7, 8]})
pd.concat([df_top, df_bottom], ignore_index=True)

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [25]:
left = pd.DataFrame({"key": ["A", "B"], "val1": [1, 2]})
right = pd.DataFrame({"key": ["B", "C"], "val2": [3, 4]})
pd.merge(left, right, on="key", how="inner")

  key  val1  val2
0   B     2     3

In [26]:
pd.merge(left, right, on="key", how="left")

  key  val1  val2
0   A     1   NaN
1   B     2   3.0

## 7) Map and apply

In [27]:
gender_df = pd.DataFrame({"Name": ["Ana", "Ben"], "Gender": ["Female", "Male"]})
gender_df["Gender_Code"] = gender_df["Gender"].map({"Male": 0, "Female": 1})
gender_df["Name_Length"] = gender_df["Name"].map(len)
gender_df

  Name  Gender  Gender_Code  Name_Length
0  Ana  Female            1            3
1  Ben    Male            0            3

In [46]:
def summarize(row):
    return f"{row['Name']} is {row['Gender'].lower()}"

gender_df["Summary"] = gender_df.apply(summarize, axis=1)
gender_df

  Name  Gender  Gender_Code  Name_Length        Summary
0  Ana  Female            1            3  Ana is female
1  Ben    Male            0            3    Ben is male